In [1]:
import pandas as pd

In [3]:
chunksize = 10 ** 8

for chunk in pd.read_csv('purchase_info/again_data.csv', chunksize=chunksize):
    process(chunk)

NameError: name 'process' is not defined

---

*이런식으로 불러와야해

In [12]:
c = pd.read_csv('chunk/chunk1.csv')

In [13]:
c.head(3)

,Unnamed: 0,biz_dt,m_id,order_price,prod_no,old_admin_category_id,serv_cd
0,10000000,2018-01-22 18:53:02,"1,345,775","29,900","3,195,301","237,050,504",1
1,10000001,2018-01-22 18:53:02,"6,095,620","16,800","1,657,241","241,030,207",1
2,10000002,2018-01-22 18:53:02,"6,095,620","17,800","1,704,136","237,040,401",1

---

In [9]:
chunksize = 10 ** 7

In [10]:
for i,chunk in enumerate(pd.read_csv('purchase_info/again_data.csv', chunksize=chunksize)):
    chunk.to_csv('chunk/chunk{}.csv'.format(i))

In [17]:
dd = {}
for i in range(13):
    dd[i] =  pd.read_csv('chunk/chunk{}.csv'.format(i))

---

*확인

In [18]:
dd[0].head(3)

,Unnamed: 0,biz_dt,m_id,order_price,prod_no,old_admin_category_id,serv_cd
0,0,2018-01-01 00:00:00,"1,108,503","3,000","3,105,826","244,030,804",1
1,1,2018-01-01 00:00:00,"2,787,149","3,900","3,103,786","234,010,105",1
2,2,2018-01-01 00:00:00,"3,609,397","21,000","2,879,964","101,060,500",1

In [19]:
dd[12].tail(3)

,Unnamed: 0,biz_dt,m_id,order_price,prod_no,old_admin_category_id,serv_cd
3321037,123321037,2018-09-28 17:00:22,"24,137,068","1,699,000","101,984,766","233,040,120",2
3321038,123321038,2018-09-28 17:00:25,"5,357,454","25,000","110,485,856","240,010,305",2
3321039,123321039,2018-09-28 17:00:27,"21,865,461","55,900","100,371,485","233,080,119",2

- 9월 28일까지의 데이터네

---

In [20]:
ll = ['오이', '수박', '참외']

In [21]:
for i in ll:
    print(i)

오이
수박
참외